app/controllers/categories_controller.rb

  def create
    @category = Category.create(name: params[:category][:name])
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Desenvolvedor"], ["created_at", "2016-01-29 19:46:10.342189"], ["updated_at", "2016-01-29 19:46:10.342189"]]