app/controllers/companies_controller.rb

  def create
    @company = Company.create(company_params)
---
INSERT INTO "companies" ("name", "location", "mail", "phone", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @company.update(company_params)
---
UPDATE "companies" SET "name" = ?, "location" = ?, "mail" = ?, "phone" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["name", "Code Campus"], ["location", "Recife"], ["mail", "contat@codecampus.com.br"], ["phone", "1111-5555"], ["updated_at", "2016-01-29 19:46:10.677247"], ["id", 1]]