app/controllers/dashboards_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = 1
---
def show
  if current_user.id.to_s == params[:id]
    @companies = Company.where(user: current_user)