app/controllers/jobs_controller.rb

SELECT "categories".* FROM "categories"
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_collections
    @categories = Category.all
    if current_user
      @companies = Company.where(user_id: current_user.id)
    else
      @companies = Company.all